betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_dfsdm.c
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32h417_dfsdm.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : This file contains all the functions prototypes for the  
*                      DFSDM firmware library.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32h417_dfsdm.h"
#include "ch32h417_rcc.h"

/* DFSDM register bit offset */
#define CHyCFGR1_CKOUTDIV_OFFSET                ((uint8_t)0x10)
#define CHyCFGR1_CKOUTSRC_OFFSET                ((uint8_t)0x1E)
#define CHyCFGR2_DTRBS_OFFSET                   ((uint8_t)0x03)
#define CHyCFGR2_CALIBOFF_OFFSET                ((uint8_t)0x08)
#define CHyAWSCDR_AWFOSR_OFFSET                 ((uint8_t)0x10)
#define CHyAWSCDR_AWFORD_OFFSET                 ((uint8_t)0x16)
#define FLTxCR1_AWFSEL_OFFSET                   ((uint8_t)0x1E)
#define FLTxCR1_RCH_OFFSET                      ((uint8_t)0x18)
#define FLTxCR2_AWDCH_OFFSET                    ((uint8_t)0x10)
#define FLTxFCR3_FOSR_OFFSET                    ((uint8_t)0x10)
#define FLTxFCR3_FORD_OFFSET                    ((uint8_t)0x1D)
#define FLTxJDATAR_JDATA_OFFSET                 ((uint8_t)0x08)
#define FLTxRDATAR_RDATA_OFFSET                 ((uint8_t)0x08)
#define FLTxAWHTR_AWDHT_OFFSET                  ((uint8_t)0x08)
#define FLTxAWLTR_AWDLT_OFFSET                  ((uint8_t)0x08)
#define FLTxEXMAX_EXMAX_OFFSET                  ((uint8_t)0x08)
#define FLTYEMMIN_EXMIN_OFFSET                  ((uint8_t)0x08)

/* DFSDM Flag Mask */
#define DFSDM_Flag_Mask                         ((uint8_t)0x1F)
/* DFSDM IT Flag Mask */
#define DFSDM_IT_Flag_Mask                      ((uint8_t)0x7F)
/* DFSDM data Mask */
#define DFSDM_Data_Mask                         ((uint32_t)0xFF000000)
#define DFSDM_SignBit_Mask                      ((uint32_t)0x00800000)

/*********************************************************************
 * @fn      DFSDM_DeInit
 *
 * @brief   Deinitializes the DFSDM peripheral registers to their default
 *        reset values.
 *
 * @param   none
 *
 * @return  none
 */
void DFSDM_DeInit(void)
{
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_DFSDM, ENABLE);
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_DFSDM, DISABLE);
}

/*********************************************************************
 * @fn      DFSDM_ChannelStructInit
 *
 * @brief   initialize the parameters of DFSDM channel struct with the default values.
 *
 * @param   DFSDM_ChannelInitStruct - pointer to an DFSDM_ChannelInitTypeDef structure that
 *        contains the configuration information for the specified DFSDM_Channel.
 *
 * @return  none
 */
void DFSDM_ChannelStructInit(DFSDM_ChannelInitTypeDef *DFSDM_ChannelInitStruct)
{
    DFSDM_ChannelInitStruct->DFSDM_ChDataPackMode = DFSDM_StandardMode;
    DFSDM_ChannelInitStruct->DFSDM_ChDataMultiplexer = DFSDM_SerialInput;
    DFSDM_ChannelInitStruct->DFSDM_ChInPinSelect = DFSDM_SelectCurrent;
    DFSDM_ChannelInitStruct->DFSDM_ChClockAbsenceDetMode = DISABLE;
    DFSDM_ChannelInitStruct->DFSDM_ChShortCircuitDetMode = DISABLE;
    DFSDM_ChannelInitStruct->DFSDM_ChSPIClockSource = DFSDM_ExternalClkIn;
    DFSDM_ChannelInitStruct->DFSDM_ChSerialInterface = DFSDM_SPIRising;
    DFSDM_ChannelInitStruct->DFSDM_ChCalibrationOffset = 0;
    DFSDM_ChannelInitStruct->DFSDM_ChDataRightBitShift = 0;
    DFSDM_ChannelInitStruct->DFSDM_ChAWDSincFilterOrder = DFSDM_AWD_FastSinc;
    DFSDM_ChannelInitStruct->DFSDM_ChAWDFilterOverSample = DFSDM_AWD_FLT_Bypass;
    DFSDM_ChannelInitStruct->DFSDM_ChSCDBreakSignal = DFSDM_SCD_BK_None;
    DFSDM_ChannelInitStruct->DFSDM_ChSCDCntthreshold = 0;
}

/*********************************************************************
 * @fn      DFSDM_FilterStructInit
 *
 * @brief   initialize the parameters of DFSDM filter struct with the default values.
 *
 * @param   DFSDM_FilterInitStruct - pointer to an DFSDM_FilterInitTypeDef structure that
 *          contains the configuration information for the specified DFSDM_Filter.
 *
 * @return  none
 */
void DFSDM_FilterStructInit(DFSDM_FilterInitTypeDef *DFSDM_FilterInitStruct)
{
    DFSDM_FilterInitStruct->DFSDM_FltAWDFastMode = DISABLE;
    DFSDM_FilterInitStruct->DFSDM_FltAWDChannel = DFSDM_AWD_Channel_Disable;
    DFSDM_FilterInitStruct->DFSDM_FltAWDHighThreshold = 0;
    DFSDM_FilterInitStruct->DFSDM_FltAWDLowThreshold = 0;
    DFSDM_FilterInitStruct->DFSDM_FltExtremeChannel = DFSDM_Extremes_Channel_Disable;
    DFSDM_FilterInitStruct->DFSDM_FltSincOrder = DFSDM_FLT_FastSinc;
    DFSDM_FilterInitStruct->DFSDM_FltOverSample = DFSDM_FLT_Bypass;
    DFSDM_FilterInitStruct->DFSDM_FltIntegratorOverSample = DFSDM_FLT_IOSR_Bypass;
    DFSDM_FilterInitStruct->DFSDM_FltAWDHighThrBreakSignal = DFSDM_AWDH_BK_None;
    DFSDM_FilterInitStruct->DFSDM_FltAWDLowThrBreakSignal = DFSDM_AWDL_BK_None;
}

/*********************************************************************
 * @fn      DFSDM_RcStructInit
 *
 * @brief   initialize the parameters of regular conversion struct with the default values.
 *
 * @param   DFSDM_RcInitStruct - pointer to an DFSDM_RcInitTypeDef structure that contains
 *        the configuration information for the specified regular conversion.
 *
 * @return  none
 */
void DFSDM_RcStructInit(DFSDM_RcInitTypeDef *DFSDM_RcInitStruct)
{
    DFSDM_RcInitStruct->DFSDM_RcContinuousMode = DISABLE;
    DFSDM_RcInitStruct->DFSDM_RcFastMode = DISABLE;
    DFSDM_RcInitStruct->DFSDM_RcDMAMode = DISABLE;
    DFSDM_RcInitStruct->DFSDM_RcSynchronousMode = DISABLE;
    DFSDM_RcInitStruct->DFSDM_RcChannel = DFSDM_RC_Channel0;
}

/*********************************************************************
 * @fn      DFSDM_JcStructInit
 *
 * @brief   initialize the parameters of injected conversion struct with the default values.
 *
 * @param   DFSDM_JcInitStruct - pointer to an DFSDM_JcInitTypeDef structure that contains
 *        the configuration information for the specified regular conversion.
 *
 * @return  none
 */
void DFSDM_JcStructInit(DFSDM_JcInitTypeDef *DFSDM_JcInitStruct)
{
    DFSDM_JcInitStruct->DFSDM_JcScanMode = DISABLE;
    DFSDM_JcInitStruct->DFSDM_JcDMAMode = DISABLE;
    DFSDM_JcInitStruct->DFSDM_JcChannelGroup = DFSDM_JC_Channel0;
    DFSDM_JcInitStruct->DFSDM_JcSynchronousMode = DISABLE;
    DFSDM_JcInitStruct->DFSDM_JcTriggerEdge = DFSDM_JC_Trigger_Disable;
    DFSDM_JcInitStruct->DFSDM_JcTriggerSignal = DFSDM_JC_Trigger_TIM1;
}

/*********************************************************************
 * @fn      DFSDM_ChannelInit
 *
 * @brief   Initializes the DFSDM channel according to the specified
 *          parameters in the DFSDM_ChannelInitStruct.
 *
 * @param   DFSDM_Channely - (y = 0,1)select the channel.
 *          DFSDM_ChannelInitStruct - pointer to a DFSDM_ChannelInitTypeDef structure
 *        that contains the configuration information for the specified channel.
 *
 * @return  none
 */
void DFSDM_ChannelInit(DFSDM_Channel_TypeDef *DFSDM_Channely, DFSDM_ChannelInitTypeDef *DFSDM_ChannelInitStruct)
{
    uint32_t reg;

    reg = DFSDM_Channely->CFGR1;
    reg &= ~(DFSDM_CFGR1_DFSDMEN | DFSDM_CFGR1_SPICKSEL | DFSDM_CFGR1_SITP | DFSDM_CFGR1_SCDEN | DFSDM_CFGR1_CKABEN | 
             DFSDM_CFGR1_CHINSEL | DFSDM_CFGR1_DATMPX | DFSDM_CFGR1_DATPACK);
    reg |= (uint32_t)(((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChSPIClockSource) | ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChSerialInterface) |
                     ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChDataMultiplexer) | ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChInPinSelect) |
                     ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChClockAbsenceDetMode << 0x6) |
                     ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChShortCircuitDetMode << 0x5) |
                     ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChDataPackMode));

    DFSDM_Channely->CFGR1 = reg;

    DFSDM_Channely->CFGR2 = 0;
    DFSDM_Channely->CFGR2 |= (((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChCalibrationOffset << CHyCFGR2_CALIBOFF_OFFSET) |
            ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChDataRightBitShift << CHyCFGR2_DTRBS_OFFSET));

