betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_dfsdm.c
    DFSDM_Channely->AWSCDR = 0;
    DFSDM_Channely->AWSCDR |= (uint32_t)(((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChSCDCntthreshold) | ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChSCDBreakSignal) |
                      ((uint32_t)DFSDM_ChannelInitStruct->DFSDM_ChAWDSincFilterOrder << CHyAWSCDR_AWFORD_OFFSET) |
                      ((uint32_t)(DFSDM_ChannelInitStruct->DFSDM_ChAWDFilterOverSample - 1) << CHyAWSCDR_AWFOSR_OFFSET));
}

/*********************************************************************
 * @fn      DFSDM_FilterInit
 *
 * @brief   Initializes the DFSDM filter according to the specified
 *          parameters in the DFSDM_FilterInitStruct.
 *
 * @param   DFSDM_FLTx - (x = 0,1)select the filter.
 *          DFSDM_ChannelInitStruct - pointer to a DFSDM_FilterInitTypeDef structure
 *        that contains the configuration information for the specified channel.
 *
 * @return  none
 */
void DFSDM_FilterInit(DFSDM_FLT_TypeDef *DFSDM_FLTx, DFSDM_FilterInitTypeDef *DFSDM_FilterInitStruct)
{
    uint32_t reg;

    reg = DFSDM_FLTx->CR1;
    reg &= ~(DFSDM_FLTCR1_AWFSEL);
    reg |= ((uint32_t)DFSDM_FilterInitStruct->DFSDM_FltAWDFastMode << FLTxCR1_AWFSEL_OFFSET);
    DFSDM_FLTx->CR1 = reg;

    reg = DFSDM_FLTx->CR2;
    reg &= ~(DFSDM_FLTCR2_AWDCH | DFSDM_FLTCR2_EXCH);
    reg |= (((uint32_t)DFSDM_FilterInitStruct->DFSDM_FltAWDChannel << FLTxCR2_AWDCH_OFFSET) |
            (uint32_t)DFSDM_FilterInitStruct->DFSDM_FltExtremeChannel);
    DFSDM_FLTx->CR2 = reg;

    DFSDM_FLTx->FCR3 &= ~(DFSDM_FLTFCR3_FORD | DFSDM_FLTFCR3_FOSR | DFSDM_FLTFCR3_IOSR);
    DFSDM_FLTx->FCR3 |= (((uint32_t)DFSDM_FilterInitStruct->DFSDM_FltSincOrder << FLTxFCR3_FORD_OFFSET) |
            ((uint32_t)(DFSDM_FilterInitStruct->DFSDM_FltOverSample - 1) << FLTxFCR3_FOSR_OFFSET) |
            ((uint32_t)(DFSDM_FilterInitStruct->DFSDM_FltIntegratorOverSample)));

    DFSDM_FLTx->AWHTR &= ~(DFSDM_FLTAWHTR_AWHT | DFSDM_FLTAWHTR_BKAWH);
    DFSDM_FLTx->AWHTR |= (((uint32_t)DFSDM_FilterInitStruct->DFSDM_FltAWDHighThreshold << FLTxAWHTR_AWDHT_OFFSET) |
            (uint32_t)DFSDM_FilterInitStruct->DFSDM_FltAWDHighThrBreakSignal);

    DFSDM_FLTx->AWLTR &= ~(DFSDM_FLTAWLTR_AWLT | DFSDM_FLTAWLTR_BKAWL);
    DFSDM_FLTx->AWLTR |= (((uint32_t)DFSDM_FilterInitStruct->DFSDM_FltAWDLowThreshold << FLTxAWLTR_AWDLT_OFFSET) |
            (uint32_t)DFSDM_FilterInitStruct->DFSDM_FltAWDLowThrBreakSignal);
}

/*********************************************************************
 * @fn      DFSDM_RcInit
 *
 * @brief   Initializes the regular conversion according to the specified
 *          parameters in the DFSDM_RcInitStruct.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          DFSDM_RcInitStruct - the initialization data needed to initialize regular conversion.
 *
 * @return  none
 */
void DFSDM_RcInit(DFSDM_FLT_TypeDef *DFSDM_FLTx, DFSDM_RcInitTypeDef *DFSDM_RcInitStruct)
{
    uint32_t reg;

    reg = DFSDM_FLTx->CR1;
    reg &= ~(DFSDM_FLTCR1_FAST | DFSDM_FLTCR1_RCH | DFSDM_FLTCR1_RDMAEN | DFSDM_FLTCR1_RSYNC | DFSDM_FLTCR1_RCONT);
    reg |= (((uint32_t)DFSDM_RcInitStruct->DFSDM_RcContinuousMode << 0x12) | ((uint32_t)DFSDM_RcInitStruct->DFSDM_RcFastMode << 0x1D) |
            ((uint32_t)DFSDM_RcInitStruct->DFSDM_RcDMAMode << 0x15) | ((uint32_t)DFSDM_RcInitStruct->DFSDM_RcSynchronousMode << 0x13) |
            ((uint32_t)DFSDM_RcInitStruct->DFSDM_RcChannel << FLTxCR1_RCH_OFFSET));
    DFSDM_FLTx->CR1 = reg;
}

/*********************************************************************
 * @fn      DFSDM_JcInit
 *
 * @brief   Initializes the injected conversion according to the specified
 *          parameters in the DFSDM_JcInitStruct.
 *
 * @param   DFSDM_FLTx- (x=0,1)select the filter.
 *          DFSDM_JcInitStruct - the initialization data needed to initialize injected conversion.
 *
 * @return  none
 */
void DFSDM_JcInit(DFSDM_FLT_TypeDef *DFSDM_FLTx, DFSDM_JcInitTypeDef *DFSDM_JcInitStruct)
{
    uint32_t reg;

    reg = DFSDM_FLTx->CR1;
    reg &= ~(DFSDM_FLTCR1_JEXTEN | DFSDM_FLTCR1_JEXTSEL | DFSDM_FLTCR1_JDMAEN | DFSDM_FLTCR1_JSCAN | DFSDM_FLTCR1_JSYNC);
    reg |= (uint32_t)(DFSDM_JcInitStruct->DFSDM_JcTriggerEdge | DFSDM_JcInitStruct->DFSDM_JcTriggerSignal |
         ((uint32_t)DFSDM_JcInitStruct->DFSDM_JcDMAMode << 0x5) | ((uint32_t)DFSDM_JcInitStruct->DFSDM_JcScanMode << 0x4) |
         ((uint32_t)DFSDM_JcInitStruct->DFSDM_JcSynchronousMode << 0x3));
    DFSDM_FLTx->CR1 = reg;

    // DFSDM_FLTx->JCHGR &= ~DFSDM_FLTJCHGR_JCHG;
    DFSDM_FLTx->JCHGR = (uint32_t)DFSDM_JcInitStruct->DFSDM_JcChannelGroup;
}

/*********************************************************************
 * @fn      DFSDM_OutSerialClkConfig
 *
 * @brief   Configure output serial clock source and divider.
 *
 * @param   Source - output serial clock source selection.
 *        only the following parameters can be selected:
 *            DFSDM_SysClk - source for output clock is from system clock.
 *            DFSDM_AudioClk - source for output clock is from audio clock.
 *          Div - output serial clock divider 0-255
 *            0 - No clock.
 *            others - Clock/(Div+1)
 *
 * @return  none
 */
void DFSDM_OutSerialClkConfig(uint16_t Source, uint8_t Div)
{
    DFSDM_Channel0->CFGR1 &= ~(DFSDM_CFGR1_CKOUTSRC | DFSDM_CFGR1_CKOUTDIV);
    DFSDM_Channel0->CFGR1 |= (uint32_t)((Source << CHyCFGR1_CKOUTSRC_OFFSET) | (Div << CHyCFGR1_CKOUTDIV_OFFSET));
}

/*********************************************************************
 * @fn      DFSDM_Cmd
 *
 * @brief   Enables or disables the DFSDM interface.
 *
 * @param   NewState - new state of the DFSDM interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_Cmd(FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_Channel0->CFGR1 |= DFSDM_CFGR1_DFSDMEN;
    }
    else
    {
        DFSDM_Channel0->CFGR1 &= ~DFSDM_CFGR1_DFSDMEN;
    }
}

/*********************************************************************
 * @fn      DFSDM_ChannelCmd
 *
 * @brief   Enables or disables the DFSDM channel.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          NewState - new state of the DFSDM channel(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_ChannelCmd(DFSDM_Channel_TypeDef *DFSDM_Channely, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_Channely->CFGR1 |= DFSDM_CFGR1_CHEN;
    }
    else
    {
        DFSDM_Channely->CFGR1 &= ~DFSDM_CFGR1_CHEN;
    }
}

/*********************************************************************
 * @fn      DFSDM_SPIClockSourceConfig
 *
 * @brief   Configure the SPI clock source.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Source - SPI clock source.
 *        only the following parameters can be selected:
 *            DFSDM_ExternalClkIn - external CKINy input.
 *            DFSDM_InternalClkOut - internal CKOUT output.
 *            DFSDM_InternalHalfFall - internal CKOUT(falling edge).
 *            DFSDM_InternalHalfRise - internal CKOUT(rising edge).
 *                  
 * @return  none
 */
void DFSDM_SPIClockSourceConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, uint16_t Source)
{
    DFSDM_Channely->CFGR1 &= ~DFSDM_CFGR1_SPICKSEL;
    DFSDM_Channely->CFGR1 |= Source;
}

/*********************************************************************
 * @fn      DFSDM_SerialInterfaceConfig
 *
 * @brief   Configure serial interface type.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          type - serial interface type.
 *        only the following parameters can be selected:
 *            DFSDM_SPIRising - SPI with rising edge to strobe data.
 *            DFSDM_SPIFalling - SPI with falling edge to strobe data.
 *                  
 * @return  none
 */
void DFSDM_SerialInterfaceConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, uint16_t Type)
{
    DFSDM_Channely->CFGR1 &= ~DFSDM_CFGR1_SITP;
    DFSDM_Channely->CFGR1 |= (uint32_t)Type;
}

/*********************************************************************
 * @fn      DFSDM_ShortCircuitDetCmd
 *
 * @brief   Enables or disables the short-circuit detector.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          NewState - new state of short circuit detector(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_ShortCircuitDetCmd(DFSDM_Channel_TypeDef *DFSDM_Channely, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_Channely->CFGR1 |= DFSDM_CFGR1_SCDEN;
    }
    else
    {
        DFSDM_Channely->CFGR1 &= ~DFSDM_CFGR1_SCDEN;
    }
}

/*********************************************************************
 * @fn      DFSDM_ClockAbsenceDetCmd
 *
 * @brief   Enables or disables the clock absence detector.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          NewState - new state of clock absence detector(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_ClockAbsenceDetCmd(DFSDM_Channel_TypeDef *DFSDM_Channely, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_Channely->CFGR1 |= DFSDM_CFGR1_CKABEN;
    }
    else
    {
        DFSDM_Channely->CFGR1 &= ~DFSDM_CFGR1_CKABEN;
    }
}

/*********************************************************************
 * @fn      DFSDM_ChannelInputSelect
 *
 * @brief   Channel inputs selection.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Pin_sel - channel inputs selection
 *        only the following parameters can be selected:
 *            DFSDM_SelectCurrent - current channel.
 *            DFSDM_SelectNext - next channel.
 *
 * @return  none
 */
void DFSDM_ChannelInputSelect(DFSDM_Channel_TypeDef *DFSDM_Channely, uint16_t Pin_sel)
{
    DFSDM_Channely->CFGR1 &= ~DFSDM_CFGR1_CHINSEL;
    DFSDM_Channely->CFGR1 |= (uint32_t)Pin_sel;
}

/*********************************************************************
 * @fn      DFSDM_DataPackModeConfig
 *
 * @brief   Configure data packing mode.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Mode - data packing mode.
 *        only the following parameters can be selected:
 *            DFSDM_StandardMode - standard mode.
 *            DFSDM_InterleaveMode - interleaved mode.
 *            DFSDM_DualMode - dual mode.
 *                  
 * @return  none
 */
void DFSDM_DataPackModeConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, uint16_t Mode)
{
    DFSDM_Channely->CFGR1 &= ~DFSDM_CFGR1_DATPACK;
    DFSDM_Channely->CFGR1 |= (uint32_t)Mode;
}

/*********************************************************************
 * @fn      DFSDM_ChannelInDataMpxConfig
 *
 * @brief   Configure Input data multiplexer for channel.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Source - input data source.
 *        only the following parameters can be selected:
 *            DFSDM_SerialInput - external serial inputs.
 *            DFSDM_ADCInput - ADC output register.
 *            DFSDM_InternalInput - internal register.
 *                  
 * @return  none
 */
void DFSDM_ChannelInDataMpxConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, uint16_t Source)
{
    DFSDM_Channely->CFGR1 &= ~DFSDM_CFGR1_DATMPX;
    DFSDM_Channely->CFGR1 |= (uint32_t)Source;
}

/*********************************************************************
 * @fn      DFSDM_CalibrationOffsetConfig
 *
 * @brief   Configure calibration offset for channel.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Offset - 24-bit calibration offset.
 *                  
 * @return  none
 */
void DFSDM_CalibrationOffsetConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, int32_t Offset)
{
    DFSDM_Channely->CFGR2 &= ~DFSDM_CFGR2_OFFSET;
    DFSDM_Channely->CFGR2 |= ((uint32_t)Offset << CHyCFGR2_CALIBOFF_OFFSET);
}

/*********************************************************************
 * @fn      DFSDM_DataRightBitShiftConfig
 *
 * @brief   Configure data right bit-shift for channel.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Shift - the right shift(0-8 is valid).
 *                  
 * @return  none
 */
void DFSDM_DataRightBitShiftConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, uint8_t Shift)
{
    DFSDM_Channely->CFGR2 &= ~DFSDM_CFGR2_DTRBS;
    DFSDM_Channely->CFGR2 |= ((uint32_t)Shift << CHyCFGR2_DTRBS_OFFSET);
}

/*********************************************************************
 * @fn      DFSDM_SCDBreakSignalConfig
 *
 * @brief   Configure break signal assignment for short-circuit detector.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Signal -  break signal assignment.
 *        only the following parameters can be selected:
 *            DFSDM_SCD_BK_None - break signal0 and signal1 is not assigned.
 *            DFSDM_SCD_BK_0 - break signal0 is assigned, break signal1 is not assigned.
 *            DFSDM_SCD_BK_1 - break signal1 is assigned, break signal0 is not assigned.
 *            DFSDM_SCD_BK_0_1 - break signal0 and signal1 is assigned.
 *                  
 * @return  none
 */
void DFSDM_SCDBreakSignalConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, uint16_t Signal)
{
    DFSDM_Channely->AWSCDR &= ~DFSDM_AWSCDR_BKSCD;
    DFSDM_Channely->AWSCDR |= (uint32_t)Signal;
}

/*********************************************************************
 * @fn      DFSDM_SCDCounterThrConfig
 *
 * @brief   Configure short-circuit detector threshold.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Threshold - the threshold counter for short-circuit detector(0-255).
 *                  
 * @return  none
 */
void DFSDM_SCDCounterThrConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, uint8_t Threshold)
{
    DFSDM_Channely->AWSCDR &= ~DFSDM_AWSCDR_SCDT;
    DFSDM_Channely->AWSCDR |= (uint32_t)Threshold;
}

/*********************************************************************
 * @fn      DFSDM_WriteParallelDataStanMode
 *
 * @brief   Write the parallel data on standard mode of data packing.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Data - the parallel data.
 *                  
 * @return  none
 */
void DFSDM_WriteParallelDataStanMode(DFSDM_Channel_TypeDef *DFSDM_Channely, int16_t Data)
{
    DFSDM_Channely->DATINR0 = (int16_t)Data;
}

/*********************************************************************
 * @fn      DFSDM_WriteParallelDataIntlMode
 *
 * @brief   Write the parallel data on interleaved mode of data packing.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Data0 - the parallel data0.
 *          Data1 - the parallel data1.
 *                  
 * @return  none
 */
void DFSDM_WriteParallelDataIntlMode(DFSDM_Channel_TypeDef *DFSDM_Channely, int16_t Data0, int16_t Data1)
{
    DFSDM_Channely->DATINR0 = (int16_t)Data0;
    DFSDM_Channely->DATINR1 = (int16_t)Data1;
}

/*********************************************************************
 * @fn      DFSDM_WriteParallelDataDualMode
 *
 * @brief   Write the parallel data on dual mode of data packing.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Data0 - the parallel data0.
 *          Data1 - the parallel data1.
 *                  
 * @return  none
 */
void DFSDM_WriteParallelDataDualMode(DFSDM_Channel_TypeDef *DFSDM_Channely, int16_t Data0, int16_t Data1)
{
    DFSDM_Channely->DATINR0 = (int16_t)Data0;
    DFSDM_Channely->DATINR1 = (int16_t)Data1;
}

/*********************************************************************
 * @fn      DFSDM_FilterCmd
 *
 * @brief   Enables or disables the DFSDM filter.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of the DFSDM filter(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_FilterCmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_DFEN;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_DFEN;
    }
}

/*********************************************************************
 * @fn      DFSDM_FilterConfig
 *
 * @brief   Configure DFSDM sinc filter order,oversample and integrator oversample.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          order - sinc filter order
 *        only the following parameters can be selected:
 *            DFSDM_FLT_FastSinc - FastSinc filter type.
 *            DFSDM_FLT_Sinc1 - Sinc1 filter type.
 *            DFSDM_FLT_Sinc2 - Sinc2 filter type.
 *            DFSDM_FLT_Sinc3 - Sinc3 filter type.
 *            DFSDM_FLT_Sinc4 - Sinc4 filter type.
 *            DFSDM_FLT_Sinc5 - Sinc5 filter type.
 *         Fosr - sinc filter oversampling rate(1-1024).
 *         Iosr - integrator oversampling rate(0-2^Iosr).
 *                  
 * @return  none
 */
void DFSDM_FilterConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t Order, uint16_t Fosr, uint16_t Iosr)
{
    DFSDM_FLTx->FCR3 &= ~(DFSDM_FLTFCR3_FORD | DFSDM_FLTFCR3_FOSR | DFSDM_FLTFCR3_IOSR);
    DFSDM_FLTx->FCR3 |= (((uint32_t)Order << FLTxFCR3_FORD_OFFSET) |
    ((uint32_t)(Fosr - 1) << FLTxFCR3_FOSR_OFFSET) | (uint32_t)(Iosr));
}
/*********************************************************************
 * @fn      DFSDM_AWDFilterConfig
 *
 * @brief   Configure analog watchdog Sinc filter order and oversample.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *          Order - analog watchdog Sinc filter order
 *        only the following parameters can be selected:
 *            DFSDM_AWD_FastSinc - FastSinc filter type.
 *            DFSDM_AWD_Sinc1 - Sinc1 filter type.
 *            DFSDM_AWD_Sinc2 - Sinc2 filter type.
 *            DFSDM_AWD_Sinc3 - Sinc3 filter type.
 *          Owfosr - Sinc filter oversampling rate(1-32).
 *                  
 * @return  none
 */
void DFSDM_AWDFilterConfig(DFSDM_Channel_TypeDef *DFSDM_Channely, uint16_t Order, uint8_t Awfosr)
{
    DFSDM_Channely->AWSCDR &= ~(DFSDM_AWSCDR_AWFORD | DFSDM_AWSCDR_AWFOSR);
    DFSDM_Channely->AWSCDR |= (((uint32_t)Order << CHyAWSCDR_AWFORD_OFFSET) |
            ((uint32_t)(Awfosr - 1) << CHyAWSCDR_AWFOSR_OFFSET));
}

/*********************************************************************
 * @fn      DFSDM_ReadAWDFilterData
 *
 * @brief   Read the analog watchdog filter data.
 *
 * @param   DFSDM_Channely - (y=0,1)select the channel.
 *                  
 * @return  the input DFSDM_Channely watchdog data.
 */
int16_t DFSDM_ReadAWDFilterData(DFSDM_Channel_TypeDef *DFSDM_Channely)
{
    return (int16_t)DFSDM_Channely->WDATR;
}

/*********************************************************************
 * @fn      DFSDM_AWDFilterFastModeCmd
 *
 * @brief   Enables or disables the analog watchdog filter fast mode.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of the analog watchdog filter fast mode(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_AWDFilterFastModeCmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_AWFSEL;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_AWFSEL;
    }
}

/*********************************************************************
 * @fn      DFSDM_AWDChannelConfig
 *
 * @brief   Configure the analog watchdog channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Channel - select channel y(y=0,1).
 *        only the following parameters can be selected:
 *            DFSDM_AWD_Channel_Disable - disabled all channel.
 *            DFSDM_AWD_Channel0 - select channel0.
 *            DFSDM_AWD_Channel1 - select channel1.
 *            DFSDM_AWD_Channel0_1 - select channel0 and channel1.
 *                  
 * @return  none
 */
void DFSDM_AWDChannelConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t Channel)
{
    DFSDM_FLTx->CR2 &= ~DFSDM_FLTCR2_AWDCH;
    DFSDM_FLTx->CR2 |= (uint32_t)Channel << FLTxCR2_AWDCH_OFFSET;
}

/*********************************************************************
 * @fn      DFSDM_AWDHighThresholdConfig
 *
 * @brief   Configure analog watchdog high threshold value.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Value - high threshold value(-8388608~8388607).
 *                  
 * @return  none
 */
void DFSDM_AWDHighThresholdConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, int32_t Value)
{
    DFSDM_FLTx->AWHTR &= ~DFSDM_FLTAWHTR_AWHT;
    DFSDM_FLTx->AWHTR |= (uint32_t)Value << FLTxAWHTR_AWDHT_OFFSET;
}

/*********************************************************************
 * @fn      DFSDM_AWDLowThresholdConfig
 *
 * @brief   Configure analog watchdog low threshold value.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Value - low threshold value(-8388608~8388607).
 *                  
 * @return  none
 */
void DFSDM_AWDLowThresholdConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, int32_t Value)
{
    DFSDM_FLTx->AWLTR &= ~DFSDM_FLTAWLTR_AWLT;
    DFSDM_FLTx->AWLTR |= (uint32_t)Value << FLTxAWLTR_AWDLT_OFFSET;
}

/*********************************************************************
 * @fn      DFSDM_AWDHighThrBKConfig
 *
 * @brief   Configure analog watchdog high threshold event break signal.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Signal - high threshold event break signal.
 *        only the following parameters can be selected:
 *            DFSDM_AWDH_BK_None - break signal0 and signal1 is not assigned.
 *            DFSDM_AWDH_BK_0 - break signal0 is assigned.
 *            DFSDM_AWDH_BK_1 - break signal1 is assigned.
 *            DFSDM_AWDH_BK_0_1 - break signal0 and signal1 is assigned.
 *                  
 * @return  none
 */
void DFSDM_AWDHighThrBKConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t Signal)
{
    DFSDM_FLTx->AWHTR &= ~DFSDM_FLTAWHTR_BKAWH;
    DFSDM_FLTx->AWHTR |= (uint32_t)Signal;
}

/*********************************************************************
 * @fn      DFSDM_AWDLowThrBKConfig
 *
 * @brief   Configure analog watchdog low threshold event break signal.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Signal - high threshold event break signal.
 *            DFSDM_AWDL_BK_None - break signal0 and signal1 is not assigned.
 *            DFSDM_AWDL_BK_0 - break signal0 is assigned.
 *            DFSDM_AWDL_BK_1 - break signal1 is assigned.
 *            DFSDM_AWDL_BK_0_1 - break signal0 and signal1 is assigned.
 *                  
 * @return  none
 */
void DFSDM_AWDLowThrBKConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t Signal)
{
    DFSDM_FLTx->AWLTR &= ~DFSDM_FLTAWLTR_BKAWL;
    DFSDM_FLTx->AWLTR |= (uint32_t)Signal;
}

/*********************************************************************
 * @fn      DFSDM_ExtrDetChannelConfig
 *
 * @brief   Configure extremes detector channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Channel - extremes detector channel selection.
 *        only the following parameters can be selected:
 *            DFSDM_Extremes_Channel_Disable - extremes detector does not accept data.
 *            DFSDM_Extremes_Channel0 - accept data from channel0.
 *            DFSDM_Extremes_Channel1 - accept data from channel1.
 *            DFSDM_Extremes_Channel0_1 - accept data from channel0 and channel1.
 *                  
 * @return  none
 */
void DFSDM_ExtrDetChannelConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t Channel)
{
    DFSDM_FLTx->CR2 &= ~DFSDM_FLTCR2_EXCH;
    DFSDM_FLTx->CR2 |= (uint32_t)Channel;
}

/*********************************************************************
 * @fn      DFSDM_ReadExtrMaxData
 *
 * @brief   Read extremes detector maximum value.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *                  
 * @return  the maximum value.
 */
int32_t DFSDM_ReadExtrMaxData(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    uint32_t val;
 
    val = DFSDM_FLTx->EXMAX >> FLTxEXMAX_EXMAX_OFFSET;
    if(val & DFSDM_SignBit_Mask)
    {
        val |= DFSDM_Data_Mask;
    }
    return (int32_t)val;
}

