betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_dfsdm.c
/*********************************************************************
 * @fn      DFSDM_GetExtrMaxDataChannel
 *
 * @brief   Get extremes detector maximum value channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *
 * @return  the channel.
 */
uint8_t DFSDM_GetExtrMaxDataChannel(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    return (uint8_t)(DFSDM_FLTx->EXMAX & DFSDM_FLTEXMAX_EXMAXCH);
}

/*********************************************************************
 * @fn      DFSDM_ReadExtrMinData
 *
 * @brief   Read extremes detector minimum value.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *                  
 * @return  the minimum value.
 */
int32_t DFSDM_ReadExtrMinData(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    uint32_t val;

    val = DFSDM_FLTx->EXMIN >> FLTYEMMIN_EXMIN_OFFSET;
    if(val & DFSDM_SignBit_Mask)
    {
        val |= DFSDM_Data_Mask;
    }
    return (int32_t)val;
}

/*********************************************************************
 * @fn      DFSDM_GetExtrMinDataChannel
 *
 * @brief   Get extremes detector minimum value channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *
 * @return  the channel.
 */
uint8_t DFSDM_GetExtrMinDataChannel(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    return (uint8_t)(DFSDM_FLTx->EXMIN & DFSDM_FLTEXMIN_EXMINCH);
}

/*********************************************************************
 * @fn      DFSDM_ReadCntConvTimeData
 *
 * @brief   Read the counting conversion time.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *                  
 * @return  counting conversion time value.
 */
uint32_t DFSDM_ReadCntConvTimeData(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    return (uint32_t)(DFSDM_FLTx->NVTIMR + 1);
}

/*********************************************************************
 * @fn      DFSDM_RcFastConvCmd
 *
 * @brief   Enables or disables the regular conversion fast conversion mode.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of the regular conversion fast conversion mode(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_RcFastConvCmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_FAST;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_FAST;
    }  
}

/*********************************************************************
 * @fn      DFSDM_RcChannelConfig
 *
 * @brief   Configure regular conversion channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Channel - the regular conversion channel selection.
 *        only the following parameters can be selected:
 *          DFSDM_RC_Channel0 - channel 0 is selected.
 *          DFSDM_RC_Channel1 - channel 1 is selected.
 *
 * @return  none
 */
void DFSDM_RcChannelConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t Channel)
{
    uint32_t reg;

    reg = DFSDM_FLTx->CR1;
    reg &= ~DFSDM_FLTCR1_RCH;
    reg |= (uint32_t)Channel << FLTxCR1_RCH_OFFSET;
    DFSDM_FLTx->CR1 = reg;
}

/*********************************************************************
 * @fn      DFSDM_RcDMACmd
 *
 * @brief   Enables or disables the regular conversion DMA channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of DMA channel(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_RcDMACmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_RDMAEN;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_RDMAEN;
    }  
}

/*********************************************************************
 * @fn      DFSDM_RcConvSynsCmd
 *
 * @brief   Enables or disables Launch regular conversion synchronously.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of conversion synchronously(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_RcConvSynsCmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_RSYNC;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_RSYNC;
    }    
}

/*********************************************************************
 * @fn      DFSDM_RcContinuousCmd
 *
 * @brief   Enables or disables continuous mode for regular conversions.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of continuous mode(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_RcContinuousCmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_RCONT;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_RCONT;
    }
}

/*********************************************************************
 * @fn      DFSDM_RcSoftStartConversion
 *
 * @brief   Software start of a conversion on the regular channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *
 * @return  none
 */
void DFSDM_RcSoftStartConversion(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_RSWSTART;
}

/*********************************************************************
 * @fn      DFSDM_RcReadData
 *
 * @brief   Read the regular conversions data.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *
 * @return  the regular conversions data.
 */
int32_t DFSDM_RcReadConvData(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    uint32_t val;

    val = DFSDM_FLTx->RDATAR >> FLTxRDATAR_RDATA_OFFSET;
    if(val & DFSDM_SignBit_Mask)
    {
        val |= DFSDM_Data_Mask;
    }
    return (int32_t)val;
}

/*********************************************************************
 * @fn      DFSDM_RcGetLatestConvChannel
 *
 * @brief   Get the regular channel most recently converted.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *
 * @return  the regular channel most recently converted.
 */
uint32_t DFSDM_RcGetLatestConvChannel(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    return (uint32_t)(DFSDM_FLTx->RDATAR & DFSDM_FLTRDATAR_RDATACH);
}

/*********************************************************************
 * @fn      DFSDM_JcTrigSignConfig
 *
 * @brief   Configure injected trigger signal.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Trigger - trigger enable and trigger edge selection for injected conversions.
 *        This parameter can be a value of @ref Inject_Trigger_Signal
 *          Trigger_edge - trigger signal selection.
 *        only the following parameters can be selected:
 *            DFSDM_JC_Trigger_Disable - trigger detection is disabled
 *            DFSDM_JC_Trigger_Rising - each rising edge on the selected trigger
 *            DFSDM_JC_Trigger_Falling - each falling edge on the selected trigger
 *            DFSDM_JC_Trigger_Edge - both rising edges and falling edges on the selected trigger
 *
 * @return  none
 */
void DFSDM_JcTrigSignConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t Trigger, uint16_t Trigger_edge)
{
    DFSDM_FLTx->CR1 &= ~(DFSDM_FLTCR1_JEXTSEL | DFSDM_FLTCR1_JEXTEN);
    DFSDM_FLTx->CR1 |= (uint32_t)(Trigger | Trigger_edge);
}

/*********************************************************************
 * @fn      DFSDM_JcDMACmd
 *
 * @brief   Enables or disables the injected conversion DMA channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of DMA channel(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_JcDMACmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_JDMAEN;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_JDMAEN;
    }  
}

/*********************************************************************
 * @fn      DFSDM_JcScanConvCmd
 *
 * @brief   Enables or disables scan conversion mode for injected.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of scan conversion mode(ENABLE or DISABLE)
 *
 * @return  none
 */
void DFSDM_JcScanConvCmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_JSCAN;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_JSCAN;
    }  
}

/*********************************************************************
 * @fn      DFSDM_JcConvSynsCmd
 *
 * @brief   Enables or disables the injected conversion synchronously.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          NewState - new state of conversion synchronously(ENABLE or DISABLE).
 *
 * @return  none
 */
void DFSDM_JcConvSynsCmd(DFSDM_FLT_TypeDef *DFSDM_FLTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_JSYNC;
    }
    else
    {
        DFSDM_FLTx->CR1 &= ~DFSDM_FLTCR1_JSYNC;
    }    
}

/*********************************************************************
 * @fn      DFSDM_JcSoftStartConversion
 *
 * @brief   Start a conversion of the injected group of channels.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *
 * @return  none
 */
void DFSDM_JcSoftStartConversion(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    DFSDM_FLTx->CR1 |= DFSDM_FLTCR1_JSWSTART;
}

/*********************************************************************
 * @fn      DFSDM_JcChannelConfig
 *
 * @brief   Configure injected group conversions channel.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Channel - the injected conversion group channel selection.
 *        only the following parameters can be selected:
 *            DFSDM_JC_Channel_Disable - injected group conversions channel0 and channel1 is not assigned. 
 *            DFSDM_JC_Channel0 - injected group conversions channel0 is assigned. 
 *            DFSDM_JC_Channel1 - injected group conversions channel1 is assigned. 
 *            DFSDM_JC_Channel0_1 - injected group conversions channel0 and channel1 is assigned. 
 *
 * @return  none
 */
void DFSDM_JcChannelConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t Channel)
{
    DFSDM_FLTx->JCHGR = 0;
    DFSDM_FLTx->JCHGR |= (uint32_t)Channel;
}

/*********************************************************************
 * @fn      DFSDM_JcReadData
 *
 * @brief   Reas the inject conversions data.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *
 * @return  the injected conversions data.
 */
int32_t DFSDM_JcReadConvData(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    uint32_t val;

    val = DFSDM_FLTx->JDATAR >> FLTxJDATAR_JDATA_OFFSET;
    if(val & DFSDM_SignBit_Mask)
    {
        val |= 0xFF000000;
    }
    return (int32_t)val;
}

/*********************************************************************
 * @fn      DFSDM_JcGetLatestConvChannel
 *
 * @brief   Get the injected channel most recently converted.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *
 * @return  the channel.
 */
uint8_t DFSDM_JcGetLatestConvChannel(DFSDM_FLT_TypeDef *DFSDM_FLTx)
{
    return (uint8_t)(DFSDM_FLTx->JDATAR & DFSDM_FLTJDATAR_JDATACH);
}

/*********************************************************************
 * @fn      DFSDM_GetFlagStatus
 *
 * @brief   get the DFSDM flags.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          DFSDM_FLAG - specifies the flag to check
 *        only one of the following parameters can be selected:
 *            DFSDM_FLAG_FLTx_JEOCF - JEOCF flag
 *            DFSDM_FLAG_FLTx_REOCF - REOCF flag
 *            DFSDM_FLAG_FLTx_JOVRF - JOVRF flag
 *            DFSDM_FLAG_FLTx_ROVRF - ROVRF flag
 *            DFSDM_FLAG_FLTx_AWDF - AWDF flag
 *            DFSDM_FLAG_FLTx_JCIP - JCIP flag
 *            DFSDM_FLAG_FLTx_RCIP - RCIP flag
 *            DFSDM_FLAG_FLT0_CKABF0 - CKABF0 flag
 *            DFSDM_FLAG_FLT0_CKABF1 - CKABF1 flag
 *            DFSDM_FLAG_FLT0_SCDF0 - SCDF0 flag
 *            DFSDM_FLAG_FLT0_SCDF1 - SCDF1 flag
 *            DFSDM_FLAG_FLTx_RPEND - RPEND flag
 *            DFSDM_FLAG_FLTx_AWLTF0 - AWLTF0 flag
 *            DFSDM_FLAG_FLTx_AWLTF1 - AWLTF1 flag
 *            DFSDM_FLAG_FLTx_AWHTF0 - AWHTF0 flag
 *            DFSDM_FLAG_FLTx_AWHTF1 - AWHTF1 flag
 *                  
 * @return  FlagStatus - SET or RESET
 */
FlagStatus DFSDM_GetFlagStatus(DFSDM_FLT_TypeDef *DFSDM_FLTx,uint8_t DFSDM_FLAG)
{
    FlagStatus bitstatus = RESET;
    uint8_t tmp = 0;
    uint32_t statusreg = 0;
    
    tmp = DFSDM_FLAG >> 5;
    if(tmp == 0x3) DFSDM_FLTx = DFSDM_FLT0;

    switch (tmp) {
        case 1:
            statusreg = DFSDM_FLTx->ISR;
            break;
        case 2:
            statusreg = DFSDM_FLTx->RDATAR;
            break;
        case 3:
            statusreg = DFSDM_FLTx->ISR;
            break;
        case 4:
            statusreg = DFSDM_FLTx->AWSR;
            break;
        default:
            break;
    }
    tmp = DFSDM_FLAG & DFSDM_Flag_Mask;
    if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/*********************************************************************
 * @fn      DFSDM_ClearFlag
 *
 * @brief   Clears the DFSDM's pending flags.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          DFSDM_FLAG - specifies the flag to check
 *        only one of the following parameters can be selected:
 *            DFSDM_FLAG_FLTx_JEOCF - JEOCF flag
 *            DFSDM_FLAG_FLTx_REOCF - REOCF flag
 *            DFSDM_FLAG_FLTx_JOVRF - JOVRF flag
 *            DFSDM_FLAG_FLTx_ROVRF - ROVRF flag
 *            DFSDM_FLAG_FLTx_AWDF - AWDF flag
 *            DFSDM_FLAG_FLT0_CKABF0 - CKABF0 flag
 *            DFSDM_FLAG_FLT0_CKABF1 - CKABF1 flag
 *            DFSDM_FLAG_FLT0_SCDF0 - SCDF0 flag
 *            DFSDM_FLAG_FLT0_SCDF1 - SCDF1 flag
 *            DFSDM_FLAG_FLTx_AWLTF0 - AWLTF0 flag
 *            DFSDM_FLAG_FLTx_AWLTF1 - AWLTF1 flag
 *            DFSDM_FLAG_FLTx_AWHTF0 - AWHTF0 flag
 *            DFSDM_FLAG_FLTx_AWHTF1 - AWHTF1 flag               
 *
 * @return  none
 */
void DFSDM_ClearFlag(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint8_t DFSDM_FLAG)
{
    uint8_t tmp = 0;
    uint8_t bit_pos = 0;

    tmp = DFSDM_FLAG >> 5;
    bit_pos = DFSDM_FLAG & DFSDM_Flag_Mask;
    
    if(tmp == 0x4)
    {
        DFSDM_FLTx->AWCFR |= ((uint32_t)1 << bit_pos);
    }
    else 
    {
        switch (DFSDM_FLAG) {
            case DFSDM_FLAG_FLTx_JEOCF:
                (void)DFSDM_FLTx->JDATAR;
                break;
            case DFSDM_FLAG_FLTx_REOCF:
                (void)DFSDM_FLTx->RDATAR;
                break;
            case DFSDM_FLAG_FLTx_AWDF:
                DFSDM_FLTx->AWCFR |= (DFSDM_FLTAWSR_AWLTF | DFSDM_FLTAWSR_AWHTF);
                break;
            default:
            {
                if(tmp == 0x3) DFSDM_FLTx = DFSDM_FLT0;
                DFSDM_FLTx->ICR |= ((uint32_t)1 << bit_pos);
                break;
            }
        }
    }
}

/*********************************************************************
 * @fn      DFSDM_ITConfig
 *
 * @brief   Enables or disables the DFSDM interrupts.
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          Interrupt - DFSDM interrupt
 *        only one of the following parameters can be selected:
 *            DFSDM_IT_FLTx_JEOCIE - JEOCIE interrupt enable 
 *            DFSDM_IT_FLTx_REOCIE - REOCIE interrupt enable
 *            DFSDM_IT_FLTx_JOVRIE - JOVRIE interrupt enable
 *            DFSDM_IT_FLTx_ROVRIE - ROVRIE interrupt enable
 *            DFSDM_IT_FLTx_AWDIE - AWDIE interrupt enable
 *            DFSDM_IT_FLT0_SCDIE - SCDIE interrupt enable
 *            DFSDM_IT_FLT0_CKABIE - CKABIE interrupt enable
 *          NewState - the DFSDM interrupt(ENABLE or DISABLE)
 *
 * @return  none
 */
void DFSDM_ITConfig(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint8_t Interrupt, FunctionalState NewState)
{
    uint8_t is_flt0 = 0;
    uint8_t enablestatus = 0;

    is_flt0 = (Interrupt >> 0x7) & 0x1;
    enablestatus = Interrupt & DFSDM_IT_Flag_Mask;

    if(is_flt0) DFSDM_FLTx = DFSDM_FLT0;

    if(NewState != DISABLE)
    {
        DFSDM_FLTx->CR2 |= (uint32_t)enablestatus;
    }
    else
    {
        DFSDM_FLTx->CR2 &= ~(uint32_t)enablestatus;
    }
}

/*********************************************************************
 * @fn      DFSDM_GetITStatus
 *
 * @brief   Checks whether the DFSDM interrupt has occurred or not
 *
 * @param   DFSDM_FLTx - (x=0,1)select the filter.
 *          DFSDM_FLAG - specifies the flag to check
 *        only one of the following parameters can be selected:
 *            DFSDM_IT_FLAG_FLTx_JEOCF - JEOCIE interrupt flag 
 *            DFSDM_IT_FLAG_FLTx_REOCF - REOCF interrupt flag 
 *            DFSDM_IT_FLAG_FLTx_JOVRF - JOVRF interrupt flag 
 *            DFSDM_IT_FLAG_FLTx_ROVRF - ROVRF interrupt flag 
 *            DFSDM_IT_FLAG_FLTx_AWDF - AWDF interrupt flag 
 *            DFSDM_IT_FLAG_FLT0_CKABF0 - CKABF0 interrupt flag 
 *            DFSDM_IT_FLAG_FLT0_CKABF1 - CKABF1 interrupt flag 
 *            DFSDM_IT_FLAG_FLT0_SCDF0 - SCDF0 interrupt flag 
 *            DFSDM_IT_FLAG_FLT0_SCDF1 - SCDF1 interrupt flag 
 *                  
 * @return  FlagStatus - SET or RESET
 */
ITStatus DFSDM_GetITStatus(DFSDM_FLT_TypeDef *DFSDM_FLTx, uint16_t DFSDM_FLAG)
{
    ITStatus bitstatus = RESET;
    uint8_t bit_pos = 0;
    uint8_t enablestatus = 0;
    uint8_t is_flt0 = 0;

    bit_pos = (DFSDM_FLAG >> 8) & DFSDM_IT_Flag_Mask;
    enablestatus = DFSDM_FLAG & DFSDM_IT_Flag_Mask;
    is_flt0 = (DFSDM_FLAG >> 15) & 0x1;

    if(is_flt0) DFSDM_FLTx = DFSDM_FLT0;

    if(((DFSDM_FLTx->ISR & ((uint32_t)1 << bit_pos)) != (uint32_t)RESET) && 
         ((DFSDM_FLTx->CR2 & (uint32_t)enablestatus) != (uint32_t)RESET))
    {
        bitstatus = SET;
    }else
    {
        bitstatus = RESET;
    }

