betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_dfsdm.c
    return bitstatus;
}

/*********************************************************************
 * @fn      DFSDM_ClearITPendingBit
 *
 * @brief   Clears the DFSDM's interrupt pending bits.
 *
 * @param   DFSDM_FLTx:(x=0,1)select the filter.
 *          DFSDM_FLAG - specifies the flag to clear.
 *        only one of the following parameters can be selected:
 *            DFSDM_IT_FLAG_FLTx_JEOCF - JEOCIE interrupt flag 
 *            DFSDM_IT_FLAG_FLTx_REOCF - REOCF interrupt flag 
 *            DFSDM_IT_FLAG_FLTx_JOVRF - JOVRF interrupt flag 
 *            DFSDM_IT_FLAG_FLTx_ROVRF - ROVRF interrupt flag 
 *            DFSDM_IT_FLAG_FLTx_AWDF - AWDF interrupt flag 
 *            DFSDM_IT_FLAG_FLT0_CKABF0 - CKABF0 interrupt flag 
 *            DFSDM_IT_FLAG_FLT0_CKABF1 - CKABF1 interrupt flag 
 *            DFSDM_IT_FLAG_FLT0_SCDF0 - SCDF0 interrupt flag 
 *            DFSDM_IT_FLAG_FLT0_SCDF1 - SCDF1 interrupt flag 
 *
 * @return  none
 */
void DFSDM_ClearITPendingBit(DFSDM_FLT_TypeDef *DFSDM_FLTx,uint16_t DFSDM_FLAG)
{
    uint16_t bit_pos = 0; 
    uint8_t is_flt0 = 0;

    bit_pos = (DFSDM_FLAG >> 8) & DFSDM_IT_Flag_Mask;
    is_flt0 = (DFSDM_FLAG >> 15) & 0x1; 

    switch (DFSDM_FLAG) {
        case DFSDM_IT_FLAG_FLTx_JEOCF:
            (void)DFSDM_FLTx->JDATAR;
            break;
        case DFSDM_IT_FLAG_FLTx_REOCF:
            (void)DFSDM_FLTx->RDATAR;
            break;
        case DFSDM_IT_FLAG_FLTx_AWDF:
            DFSDM_FLTx->AWCFR |= (DFSDM_FLTAWSR_AWLTF | DFSDM_FLTAWSR_AWHTF);
            break;
        default:
        {
            if(is_flt0) DFSDM_FLTx = DFSDM_FLT0;
            DFSDM_FLTx->ICR |= ((uint32_t)1 << bit_pos);
            break;
        }
    }
}
